app/controllers/cart_controller.rb

SELECT  `wares`.* FROM `wares` WHERE `wares`.`id` = NULL LIMIT 1
---
def index
  @tuser=session[:tuser]
  if @tuser!=nil then
  @ware_shop= session[:ware_shopping]
  @ware_cart= Hash.new
  @total=0
  end
  if @ware_shop!=nil then
      @ware_shop.each do |ware_id,amount|

        ware=Ware.find(ware_id)

SELECT  `wares`.* FROM `wares` WHERE `wares`.`id` = 1 LIMIT 1
---
  def addcart
    #判断用户是否为空
    @tuser=session[:tuser]
    if @tuser!=nil then
    #根据商品ID查询一条信息
    ware=Ware.find(params[:id])

SELECT  `wares`.* FROM `wares` WHERE `wares`.`id` = 3 LIMIT 1
---
def deleteWare
  id=params[:id]
  @tuser=session[:tuser]
  if @tuser!=nil then
ware=Ware.find(id)