app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def show
    @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1

  def new
    @order = Order.new
    @tuser=session[:tuser]
  if @tuser!=nil then
  @ware_shop= session[:ware_shopping]
  @ware_cart= Hash.new
  @total=0
  end
  if @ware_shop!=nil then
      @ware_shop.each do |ware_id,amount|
        ware=Ware.find(ware_id)
---
SELECT  `wares`.* FROM `wares` WHERE `wares`.`id` = 2 LIMIT 1

  def edit
    @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1

  def create
    @order = Order.new(order_params)
    respond_to do |format|
      if @order.save
---
INSERT INTO `orders` (`uname`, `uaddress`, `upost`, `uphone`, `uhomephone`, `pirce`, `created_at`, `updated_at`) VALUES ('admin', '11 George st', '2220', '0432231668', '39912313', 1260.0, '2015-03-27 03:18:50.165135', '2015-03-27 03:18:50.165135')