app/controllers/users_controller.rb

INSERT INTO `users` (`uname`, `upwd`, `umail`, `uphone`, `uaddress`, `uimpower`, `created_at`, `updated_at`) VALUES ('admin', 'admin', 'admin@gmail.com', '0432231778', '54 George st', '1', '2015-03-26 01:34:39.182571', '2015-03-26 01:34:39.182571')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`uname` = 'admin' AND `users`.`upwd` = 'admin' LIMIT 1
---
  def login
    uname=params[:user][:name]
    upwd=params[:user][:pass]
    session[:tuser]=nil;
    user = User.find_by_uname_and_upwd(uname,upwd)

SELECT  `users`.* FROM `users` WHERE `users`.`uname` = 'admin' LIMIT 1
---
   def checkname
   names = User.find_by_uname(params[:uname])