app/controllers/wares_controller.rb

SELECT `wares`.* FROM `wares`
---
  def index
    @wares = Ware.all

INSERT INTO `wares` (`wname`, `wdesc`, `wtype`, `wfactory`, `wprice`, `wimg`, `created_at`, `updated_at`) VALUES ('42 inch sony TV', 'a good TV', 'digital', 'sony', 0.0, '1.jpeg', '2015-03-26 06:02:33.339828', '2015-03-26 06:02:33.339828')
---
  def create
    @ware = Ware.new(ware_params)

    respond_to do |format|
      if @ware.save

UPDATE `wares` SET `wname` = 'sheep toy', `wdesc` = 'a beautiful white sheep', `wtype` = 'baby', `wprice` = 25.0, `wimg` = 'newimg62922_20080401184823_6.jpg', `updated_at` = '2015-03-26 06:25:13.673032' WHERE `wares`.`id` = 5
---
  def update
    respond_to do |format|
      if @ware.update(ware_params)

SELECT  `wares`.* FROM `wares` WHERE `wares`.`id` = 1 LIMIT 1
---
    def set_ware
      @ware = Ware.find(params[:id])